import React, { Component } from 'react';
import PropTypes from 'prop-types';
import { LIGHT_TOUCH, DEEP_DIVE } from '../Campaign/AssessmentTypes';

/**
 * Landing page for the system.
 */
export class Landing extends Component {
  render() {
    return (
      <div className="landing container rtl">
        <h1 className="landing-title">
          أهلًا بكم في البوابة الإلكترونية لتقييم نضج الأجهزة العامة في إدارة
          وقياس الأداء
        </h1>
        {this.props.type === DEEP_DIVE && (
          <p>
            يسعى المركز الوطني لقياس أداء الأجهزة العامة &quot;أداء&quot; إلى
            تمكين الأجهزة العامة، عبر ترسيخ ثقافة إدارة الأداء لديها، من خلال
            تطوير قدراتها في إدارة وقياس الأداء، حيث تم تطوير خدمة تقييم نضج
            الأجهزة العامة، وهي خدمة يقدمها مركز &quot;أداء&quot; سعياً لتمكينهم
            من خلال تحديد نقاط القوة وفرص التحسين في إدارة وقياس الأداء، وتحديد
            الإجراءات اللازمة للانتقال من مستوى النضج الحالي إلى مستوى أعلى،
            وتهدف الخدمة إلى:
          </p>
        )}
        {this.props.type === LIGHT_TOUCH && (
          <p>
            يسعى المركز الوطني لقياس أداء الأجهزة العامة &quot;أداء&quot; إلى
            تمكين الأجهزة العامة، عبر ترسيخ ثقافة إدارة الأداء لديها، من خلال
            تطوير قدراتها في إدارة وقياس الأداء، حيث تم تطوير خدمة تقييم نضج
            الأجهزة العامة، وهي خدمة يقدمها مركز &quot;أداء&quot; سعياً لتمكينهم
            من خلال تحديد نقاط القوة وفرص التحسين في إدارة وقياس الأداء، وتحديد
            الإجراءات اللازمة للانتقال من مستوى النضج الحالي إلى مستوى أعلى،
            وتهدف الخدمة إلى:
          </p>
        )}
        <ul>
          <li>
            تمكين الأجهزة العامة من خلال تزويدها بتقرير خاص يوضح مستوى نضج
            الجهاز، بالإضافة إلى تحديد الإجراءات اللازمة لرفعه إلى مستوى أعلى
            وفق أفضل الممارسات العالمية.
          </li>
          <li>
            تحديد فرص التحسين المشتركة لدى الأجهزة العامة، ليقوم مركز
            &quot;أداء&quot; بتطوير خدمات وأدوات لبناء قدرات الأجهزة العامة بما
            يتناسب مع احتياجاتها.
          </li>
        </ul>
        <p>
          ويعدّ المركز الوطني لقياس أداء الأجهزة العامة &quot;أداء&quot; مركزاً
          حكومياً مستقلاً، ویرتبط تنظیمیاً برئیس مجلس الوزراء، ويهدف لقياس أداء
          الأجهزة العامة وإعداد التقارير الدوریة حول نتائج أدائھا، ونتائج قياس
          رضا المستفيد.
        </p>
        <span className="static-alert">تنويه:</span>
        <ul>
          <li>
            يُعتبر هذا التقييم أداةً لتقييم قدرات الجهاز وليس لقياس أدائه.
          </li>

          {this.props.type === DEEP_DIVE && (
            <li>
              سيتم التحقق من البيانات والوثائق المقدمة من الجهاز من خلال مركز
              &quot;أداء&quot; لإعداد تقرير التقييم وخطة التطوير.
            </li>
          )}
          {this.props.type === LIGHT_TOUCH && (
            <li>
              يعتمد تقرير التقييم الذاتي على البيانات التي يدخلها الجهاز فقط.
            </li>
          )}
          <li>
            تُعامل نتائج هذا التقييم بسرية تامة ولا تُشارك مع أي جهة باستثناء
            الجهاز المعني بالتقييم.
          </li>
          <li>
            في حالة الضغط على زر &quot;حفظ&quot; بعد الانتهاء من التقييم، يمكن
            العودة مرة أخرى لاستكمال أو تعديل التقييم.
          </li>
          <li>
            في حالة الضغط على زر &quot;إرسال&quot; بعد الانتهاء من التقييم، لا
            يمكن العودة مرة أخرى لاستكمال أو تعديل التقييم.
          </li>
        </ul>
        <p>في حال وجود اي استفسار الرجاء التواصل عبر:</p>
        <dl className="clearfix">
          <dt>البريد الإلكتروني:</dt>
          <dd>
            <a href="mailto:ma@adaa.gov.sa" target="blank">
              ma@adaa.gov.sa
            </a>
          </dd>
          <dt>الهاتف:</dt>
          <dd>
            <a href="tel:920001156" target="blank">
              920001156
            </a>
          </dd>
        </dl>
        <br />
        <p className="align-center">
          <a
            className="button button--primary"
            onClick={() => {
              this.props.hide();
            }}
          >
            عرض التقييم
          </a>
        </p>
      </div>
    );
  }
}
export default Landing;

Landing.propTypes = {
  /** @ignore */
  hide: PropTypes.func,
  /** @ignore */
  type: PropTypes.number,
};
